Revit 2026 API

# FamilyTypeAsInteger Method

---

Provides access to the integer number of the given family parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int? AsInteger(
	FamilyParameter familyParameter
)
```
```vb
Public Function AsInteger (
	familyParameter As FamilyParameter
) As Integer?
```
```cpp
public:
Nullable<int> AsInteger(
	FamilyParameter^ familyParameter
)
```
```fsharp
member AsInteger :
        familyParameter : FamilyParameter -> Nullable<int>
```

#### Parameters

familyParameter FamilyParameter

#### Return Value

NullableInt32The integer value contained in the parameter. Returns  if the storage type of the input argument is not integer type or this parameter has no value.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"familyParameter"-is . |
| ArgumentException | Thrown if the input argument-"familyParameter"-is invalid, |

#### Reference

FamilyType Class

Autodesk.Revit.DB Namespace